; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-4-16)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city1)
	(fuel-level plane1 fl0)
	(at plane2 city2)
	(fuel-level plane2 fl2)
	(at plane3 city10)
	(fuel-level plane3 fl6)
	(at plane4 city7)
	(fuel-level plane4 fl6)
	(at person1 city3)
	(at person2 city8)
	(at person3 city0)
	(at person4 city0)
	(at person5 city0)
	(at person6 city0)
	(at person7 city1)
	(at person8 city9)
	(at person9 city3)
	(at person10 city9)
	(at person11 city5)
	(at person12 city2)
	(at person13 city3)
	(at person14 city5)
	(at person15 city6)
	(at person16 city8)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city8)
	(at person2 city7)
	(at person3 city8)
	(at person4 city7)
	(at person5 city2)
	(at person6 city6)
	(at person7 city8)
	(at person8 city8)
	(at person9 city5)
	(at person10 city8)
	(at person11 city1)
	(at person12 city10)
	(at person13 city10)
	(at person14 city0)
	(at person15 city1)
	(at person16 city2)
	))

)

; plan
1. (fly plane4 city7 city0 fl6 fl5)
   deleted: (at plane4 city7) (fuel-level plane4 fl6)
   added: (at plane4 city0) (fuel-level plane4 fl5)
   goals met: 0 of 16
2. (board person6 plane4 city0)
   deleted: (at person6 city0)
   added: (in person6 plane4)
   goals met: 0 of 16
3. (board person5 plane4 city0)
   deleted: (at person5 city0)
   added: (in person5 plane4)
   goals met: 0 of 16
4. (board person4 plane4 city0)
   deleted: (at person4 city0)
   added: (in person4 plane4)
   goals met: 0 of 16
5. (zoom plane4 city0 city6 fl5 fl4 fl3)
   deleted: (at plane4 city0) (fuel-level plane4 fl5)
   added: (at plane4 city6) (fuel-level plane4 fl3)
   goals met: 0 of 16
6. (debark person6 plane4 city6)
   deleted: (in person6 plane4)
   added: (at person6 city6)
   goals met: 1 of 16
7. (board person15 plane4 city6)
   deleted: (at person15 city6)
   added: (in person15 plane4)
   goals met: 1 of 16
8. (zoom plane4 city6 city1 fl3 fl2 fl1)
   deleted: (at plane4 city6) (fuel-level plane4 fl3)
   added: (at plane4 city1) (fuel-level plane4 fl1)
   goals met: 1 of 16
9. (board person7 plane4 city1)
   deleted: (at person7 city1)
   added: (in person7 plane4)
   goals met: 1 of 16
10. (debark person15 plane4 city1)
   deleted: (in person15 plane4)
   added: (at person15 city1)
   goals met: 2 of 16
11. (board person12 plane2 city2)
   deleted: (at person12 city2)
   added: (in person12 plane2)
   goals met: 2 of 16
12. (zoom plane2 city2 city10 fl2 fl1 fl0)
   deleted: (at plane2 city2) (fuel-level plane2 fl2)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 2 of 16
13. (zoom plane3 city10 city0 fl6 fl5 fl4)
   deleted: (at plane3 city10) (fuel-level plane3 fl6)
   added: (at plane3 city0) (fuel-level plane3 fl4)
   goals met: 2 of 16
14. (zoom plane3 city0 city3 fl4 fl3 fl2)
   deleted: (at plane3 city0) (fuel-level plane3 fl4)
   added: (at plane3 city3) (fuel-level plane3 fl2)
   goals met: 2 of 16
15. (board person9 plane3 city3)
   deleted: (at person9 city3)
   added: (in person9 plane3)
   goals met: 2 of 16
16. (board person13 plane3 city3)
   deleted: (at person13 city3)
   added: (in person13 plane3)
   goals met: 2 of 16
17. (board person1 plane3 city3)
   deleted: (at person1 city3)
   added: (in person1 plane3)
   goals met: 2 of 16
18. (debark person12 plane2 city10)
   deleted: (in person12 plane2)
   added: (at person12 city10)
   goals met: 3 of 16
19. (fly plane4 city1 city2 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 3 of 16
20. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 16
21. (debark person5 plane4 city2)
   deleted: (in person5 plane4)
   added: (at person5 city2)
   goals met: 4 of 16
22. (fly plane4 city2 city7 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 4 of 16
23. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 4 of 16
24. (debark person4 plane4 city7)
   deleted: (in person4 plane4)
   added: (at person4 city7)
   goals met: 5 of 16
25. (fly plane4 city7 city8 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 5 of 16
26. (debark person7 plane4 city8)
   deleted: (in person7 plane4)
   added: (at person7 city8)
   goals met: 6 of 16
27. (board person2 plane4 city8)
   deleted: (at person2 city8)
   added: (in person2 plane4)
   goals met: 6 of 16
28. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 16
29. (board person16 plane4 city8)
   deleted: (at person16 city8)
   added: (in person16 plane4)
   goals met: 6 of 16
30. (fly plane4 city8 city2 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 6 of 16
31. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 16
32. (debark person16 plane4 city2)
   deleted: (in person16 plane4)
   added: (at person16 city2)
   goals met: 7 of 16
33. (fly plane4 city2 city0 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 7 of 16
34. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 16
35. (board person3 plane4 city0)
   deleted: (at person3 city0)
   added: (in person3 plane4)
   goals met: 7 of 16
36. (fly plane4 city0 city7 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city7) (fuel-level plane4 fl0)
   goals met: 7 of 16
37. (refuel plane4 city7 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 7 of 16
38. (debark person2 plane4 city7)
   deleted: (in person2 plane4)
   added: (at person2 city7)
   goals met: 8 of 16
39. (fly plane4 city7 city5 fl1 fl0)
   deleted: (at plane4 city7) (fuel-level plane4 fl1)
   added: (at plane4 city5) (fuel-level plane4 fl0)
   goals met: 8 of 16
40. (refuel plane4 city5 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 16
41. (board person14 plane4 city5)
   deleted: (at person14 city5)
   added: (in person14 plane4)
   goals met: 8 of 16
42. (board person11 plane4 city5)
   deleted: (at person11 city5)
   added: (in person11 plane4)
   goals met: 8 of 16
43. (fly plane4 city5 city0 fl1 fl0)
   deleted: (at plane4 city5) (fuel-level plane4 fl1)
   added: (at plane4 city0) (fuel-level plane4 fl0)
   goals met: 8 of 16
44. (refuel plane4 city0 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 8 of 16
45. (debark person14 plane4 city0)
   deleted: (in person14 plane4)
   added: (at person14 city0)
   goals met: 9 of 16
46. (fly plane4 city0 city1 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 9 of 16
47. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 9 of 16
48. (debark person11 plane4 city1)
   deleted: (in person11 plane4)
   added: (at person11 city1)
   goals met: 10 of 16
49. (fly plane4 city1 city8 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 10 of 16
50. (debark person3 plane4 city8)
   deleted: (in person3 plane4)
   added: (at person3 city8)
   goals met: 11 of 16
51. (zoom plane3 city3 city9 fl2 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl2)
   added: (at plane3 city9) (fuel-level plane3 fl0)
   goals met: 11 of 16
52. (refuel plane3 city9 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 16
53. (board person8 plane3 city9)
   deleted: (at person8 city9)
   added: (in person8 plane3)
   goals met: 11 of 16
54. (board person10 plane3 city9)
   deleted: (at person10 city9)
   added: (in person10 plane3)
   goals met: 11 of 16
55. (fly plane3 city9 city8 fl1 fl0)
   deleted: (at plane3 city9) (fuel-level plane3 fl1)
   added: (at plane3 city8) (fuel-level plane3 fl0)
   goals met: 11 of 16
56. (refuel plane3 city8 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 11 of 16
57. (debark person8 plane3 city8)
   deleted: (in person8 plane3)
   added: (at person8 city8)
   goals met: 12 of 16
58. (debark person10 plane3 city8)
   deleted: (in person10 plane3)
   added: (at person10 city8)
   goals met: 13 of 16
59. (debark person1 plane3 city8)
   deleted: (in person1 plane3)
   added: (at person1 city8)
   goals met: 14 of 16
60. (fly plane3 city8 city10 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 14 of 16
61. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 14 of 16
62. (debark person13 plane3 city10)
   deleted: (in person13 plane3)
   added: (at person13 city10)
   goals met: 15 of 16
63. (fly plane3 city10 city5 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 15 of 16
64. (debark person9 plane3 city5)
   deleted: (in person9 plane3)
   added: (at person9 city5)
   goals met: 16 of 16
